Revit 2027 API
Rebar.EnableCrankLengthOverride Method
 Enables or disables the ability to override crank lengths for this rebar instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void EnableCrankLengthOverride(
	bool enable
)
Public Sub EnableCrankLengthOverride (
	enable As Boolean
)
public:
void EnableCrankLengthOverride(
	bool enable
)
member EnableCrankLengthOverride :
        enable : bool -> unit
Parameters
enable Boolean
 True to enable, False to disable.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace